## 데이터 모델링의 이해

#### 모델링의 정의
* 모델이란 다양한 현상에 대해 일정한 표기법에 의해 표현해 놓은 모형이다. 현실세계의 추상화된 반영이다.
* 모델링이란 다양한 현상(사람, 사물, 개념 등에 발생되는)을 표기법에 의해 규칙을 가지고 표기하는 것이다.
* 모델링이란 복잡한 현실세계를 일정한 표기법에 의해 표현하는 일!
* 모델링이란 현실세계를 추상화, 단순화, 명확화하기위해 일정한 표기법에 의해 표현하는 기법! 

#### 데이터 모델링의 정의
* 정보시스템을 구축하기 위해, 해당 업무에 어떤 데이터가 존재하는지 또는 업무가 필요로하는 정보는 무엇인지(what)를 분석하는 방법
* 업무에서 필요로하는 데이터를 시스텝 구축 방법론에 의해 분석, 설계하여 정보 시스템을 구축하는 과정.

#### 데이터 모델링의 3단계 과정
* 개념적 데이터 모델링
   * 추상화 수준이 높고 업무 중심적이고 포괄적인 수준의 모델링 진행. 
   * 사용자와 개발자가 데이터 요구사항을 정의하는 것
  
* 논리적 데이터 모델링 :
  * 구체화된 업무중심의 데이터 모델. 시스템으로 구축하고자 하는 업무에 대해 Key, 속성, 관계등을 정확하게 표현
  * 디비 설계 프로세스틔 Input으로 비즈니스 정보의 논리적인 구조와 규칙을 명확하게 표현하는 과정이다. 
  * 물리적인 스키마 설계를 하기 전 단계의 데이터 모델 상태다. 
  * 핵심은 누가, 어떻게 그리고 전산화와는 별개로 비즈니스 데이터에 존재하는 사실들을 인식하여 기록하는 것이다.
  * 정규화가 진행된다. 정규화는 논리 데이터 모델의 이로간성을 확보하고 중복을 제거하여 속성들이 가장 적절한 엔티티에 배치되도록 함으로써 신뢰성있 데이터 구조를만든다.
* 물리적 데이터 모델링 
  * 실제로 디비에 이식할수 있도록 성능, 저장 등물리적인 성격을 고려하여 설계.
  *  논리데이터 모델이 데이터 저장소로서 어떻게 하드웨어에 표현될 것인가를 다룬다. 물리적 스키마라고 한다. 

#### 데이터 독립성의 요소 
* 외부스키마
  * 뷰 단계 여러 개의 사용자 관점으로 구성. 각 사용자가 보는 개인적 db 스키마
* 개념스키마
  * 모든 데이터를 통합한 조직 전체의 eb를 기술한 것으로 db에 저장되는 데이터와 그들 간의 관례를 표현한 스키마
* 내부스키마
  * db가 물리적으로 저장된 형식
  
#### 데이터 모델링의 세가지 요소
* 업무가 관여하는 어떤것 things -> 엔티티 (단수: 인스턴스(instance) 어커런스(occurrence), 복수 : 엔티이)
* 어떤것이 가지는 성격 attributes -> 속성 (단수: 속성값 attirbute value, 복수 : 속성 atrribute)
* 업무가 관여하는 어떤것 간의 관계 relationships -> 관계 (단수: 페어링 pairing, 복수 : 관계 relaationship)

#### erd (entity relationship model) 
1. 엔티티 배치
2. erd 관계 연결 : 고객 - 주문
3. erd 관계명 표시 : 고객 --주문하다/주문받다---- 주문
4. erd 관계 차수(cardinality: 엔티디 내의 인스턴스들이 얼마나 관계에 참여하는지를 나타내는 것)와 선택성 표시 : 고객 -I-주문하다-< 주문

### 엔티티
* 업무에 피룡하고 유용한 정보를 저장하고 관리하기 위한 집합적인 것
* 반드시 해당 업무에서 필요하고 관리하고자하는 정보
* 식별자에 의해 식별가능해야한다
* 영속성으로 존재하는 인스턴스 집합이어야 한다(한개가 아니라 두개이상)
* 엔티티는 업무프로세트에 이용되야
* 반드시 속성이 있어야
* 다른 엔티티와 한 개 이상 관게가 있어야 한다.
